const scheduleData = [
    {
        date: "2026-03-31",
        isHoliday: true,
        cctv: [
            { shift: "06-14", p1: "송현섭", p2: "한규태" },
            { shift: "14-22", p1: "김우남", p2: "이지헌" },
            { shift: "22-06", p1: "최현태", p2: "김민기" }
        ],
        tod: [
            { location: "고하도", p1: "박상혁", p2: "주정현" },
            { location: "외기 평시", p1: "정혜수", p2: "홍순혁" },
            { location: "외기 핵취", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-04-01",
        isHoliday: true,
        cctv: [
            { shift: "06-14", p1: "송현섭", p2: "한규태" },
            { shift: "14-22", p1: "김우남", p2: "이지헌" },
            { shift: "22-06", p1: "최현태", p2: "김민기" }
        ],
        tod: [
            { location: "고하도", p1: "박상혁", p2: "주정현" },
            { location: "외기 평시", p1: "-", p2: "-" },
            { location: "외기 핵취", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-04-02",
        cctv: [
            { shift: "06-14", p1: "정혜수", p2: "홍순혁" },
            { shift: "14-22", p1: "박상혁", p2: "주정현" },
            { shift: "22-06", p1: "하태호", p2: "한규태" }
        ],
        tod: [
            { location: "고하도", p1: "송현섭", p2: "이지헌" },
            { location: "외기 평시", p1: "-", p2: "-" },
            { location: "외기 핵취", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-04-03",
        cctv: [
            { shift: "06-14", p1: "최현태", p2: "이지헌" },
            { shift: "14-22", p1: "하태호", p2: "김민기" },
            { shift: "22-06", p1: "송현섭", p2: "홍순혁" }
        ],
        tod: [
            { location: "고하도", p1: "김우남", p2: "한규태" },
            { location: "외기 평시", p1: "정혜수", p2: "홍순혁" },
            { location: "외기 핵취", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-04-04",
        cctv: [
            { shift: "06-14", p1: "김우남", p2: "주정현" },
            { shift: "14-22", p1: "정혜수", p2: "한규태" },
            { shift: "22-06", p1: "박상혁", p2: "이지헌" }
        ],
        tod: [
            { location: "고하도", p1: "최현태", p2: "홍순혁" },
            { location: "외기 평시", p1: "-", p2: "-" },
            { location: "외기 핵취", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-04-05",
        cctv: [
            { shift: "06-14", p1: "하태호", p2: "김민기" },
            { shift: "14-22", p1: "최현태", p2: "홍순혁" },
            { shift: "22-06", p1: "김우남", p2: "주정현" }
        ],
        tod: [
            { location: "고하도", p1: "정혜수", p2: "한규태" },
            { location: "외기 평시", p1: "하태호", p2: "김민기" },  
            { location: "외기 핵취", p1: "송현섭", p2: "이지헌" }
        ]
    },
    {
        date: "2026-04-06",
        cctv: [
            { shift: "06-14", p1: "박상혁", p2: "이지헌" },
            { shift: "14-22", p1: "정혜수", p2: "한규태" },
            { shift: "22-06", p1: "하태호", p2: "김민기" }
        ],
        tod: [
            { location: "고하도", p1: "최현태", p2: "홍순혁" },
            { location: "외기 평시", p1: "하태호", p2: "김민기" },
            { location: "외기 핵취", p1: "송현섭", p2: "이지헌" }
        ]
    },
    {
        date: "2026-04-07",
        cctv: [
            { shift: "06-14", p1: "최현태", p2: "홍순혁" },
            { shift: "14-22", p1: "김우남", p2: "주정현" },
            { shift: "22-06", p1: "박상혁", p2: "이지헌" }
        ],
        tod: [
            { location: "고하도", p1: "정혜수", p2: "한규태" },
            { location: "외기 평시", p1: "하태호", p2: "김민기" },
            { location: "외기 핵취", p1: "송현섭", p2: "이지헌" }
        ]
    },
    {
        date: "2026-04-08",
        cctv: [
            { shift: "06-14", p1: "정혜수", p2: "한규태" },
            { shift: "14-22", p1: "하태호", p2: "김민기" },
            { shift: "22-06", p1: "최현태", p2: "홍순혁" }
        ],
        tod: [
            { location: "고하도", p1: "김우남", p2: "주정현" },
            { location: "외기 평시", p1: "하태호", p2: "김민기" },
            { location: "외기 핵취", p1: "송현섭", p2: "이지헌" }
        ]
    },
    {
        date: "2026-04-09",
        cctv: [
            { shift: "06-14", p1: "김우남", p2: "주정현" },
            { shift: "14-22", p1: "박상혁", p2: "이지헌" },
            { shift: "22-06", p1: "정혜수", p2: "한규태" }
        ],
        tod: [
            { location: "고하도", p1: "하태호", p2: "김민기" },
            { location: "외기 평시", p1: "하태호", p2: "김민기" },
            { location: "외기 핵취", p1: "송현섭", p2: "이지헌" }
        ]
    },
    {
        date: "2026-04-10",
        cctv: [
            { shift: "06-14", p1: "하태호", p2: "김민기" },
            { shift: "14-22", p1: "최현태", p2: "홍순혁" },
            { shift: "22-06", p1: "김우남", p2: "주정현" }
        ],
        tod: [
            { location: "고하도", p1: "박상혁", p2: "이지헌" },
            { location: "외기 평시", p1: "정혜수", p2: "한규태" },
            { location: "외기 핵취", p1: "송현섭", p2: "이지헌" }
        ]
    },
    {
        date: "2026-04-11",
        cctv: [
            { shift: "06-14", p1: "박상혁", p2: "이지헌" },
            { shift: "14-22", p1: "정혜수", p2: "한규태" },
            { shift: "22-06", p1: "하태호", p2: "김민기" }
        ],
        tod: [
            { location: "고하도", p1: "최현태", p2: "홍순혁" },
            { location: "외기 평시", p1: "정혜수", p2: "한규태" },
            { location: "외기 핵취", p1: "송현섭", p2: "이지헌" }
        ]
    },
    {
        date: "2026-04-12",
        cctv: [
            { shift: "06-14", p1: "최현태", p2: "홍순혁" },
            { shift: "14-22", p1: "김우남", p2: "주정현" },
            { shift: "22-06", p1: "박상혁", p2: "이지헌" }
        ],
        tod: [
            { location: "고하도", p1: "정혜수", p2: "한규태" },
            { location: "외기 평시", p1: "정혜수", p2: "한규태" },
            { location: "외기 핵취", p1: "송현섭", p2: "이지헌" }
        ]
    },
    {
        date: "2026-04-13",
        cctv: [
            { shift: "06-14", p1: "정혜수", p2: "한규태" },
            { shift: "14-22", p1: "하태호", p2: "김민기" },
            { shift: "22-06", p1: "최현태", p2: "홍순혁" }
        ],
        tod: [
            { location: "고하도", p1: "김우남", p2: "주정현" },
            { location: "외기 핵취", p1: "박상혁", p2: "이지헌" }
        ]
    },
    {
        date: "2026-04-14",
        cctv: [
            { shift: "06-14", p1: "김우남", p2: "주정현" },
            { shift: "14-22", p1: "박상혁", p2: "이지헌" },
            { shift: "22-06", p1: "정혜수", p2: "한규태" }
        ],
        tod: [
            { location: "고하도", p1: "하태호", p2: "김민기" },
            { location: "-", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-04-15",
        cctv: [
            { shift: "06-14", p1: "하태호", p2: "김민기" },
            { shift: "14-22", p1: "최현태", p2: "홍순혁" },
            { shift: "22-06", p1: "김우남", p2: "주정현" }
        ],
        tod: [
            { location: "고하도", p1: "박상혁", p2: "이지헌" },
            { location: "-", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-04-16",
        cctv: [
            { shift: "06-14", p1: "박상혁", p2: "이지헌" },
            { shift: "14-22", p1: "정혜수", p2: "한규태" },
            { shift: "22-06", p1: "하태호", p2: "김민기" }
        ],
        tod: [
            { location: "고하도", p1: "최현태", p2: "홍순혁" },
            { location: "외기 핵취", p1: "김우남", p2: "주정현" }
        ]
    },
    {
        date: "2026-04-17",
        cctv: [
            { shift: "06-14", p1: "최현태", p2: "홍순혁" },
            { shift: "14-22", p1: "김우남", p2: "주정현" },
            { shift: "22-06", p1: "박상혁", p2: "이지헌" }
        ],
        tod: [
            { location: "고하도", p1: "정혜수", p2: "한규태" },
            { location: "-", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-04-18",
        cctv: [
            { shift: "06-14", p1: "정혜수", p2: "한규태" },
            { shift: "14-22", p1: "하태호", p2: "김민기" },
            { shift: "22-06", p1: "최현태", p2: "홍순혁" }
        ],
        tod: [
            { location: "고하도", p1: "김우남", p2: "주정현" },
            { location: "-", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-04-19",
        cctv: [
            { shift: "06-14", p1: "김우남", p2: "주정현" },
            { shift: "14-22", p1: "박상혁", p2: "이지헌" },
            { shift: "22-06", p1: "정혜수", p2: "한규태" }
        ],
        tod: [
            { location: "고하도", p1: "하태호", p2: "김민기" },
            { location: "외기 평시", p1: "최현태", p2: "홍순혁" }
        ]
    },
    {
        date: "2026-04-20",
        cctv: [
            { shift: "06-14", p1: "하태호", p2: "김민기" },
            { shift: "14-22", p1: "최현태", p2: "홍순혁" },
            { shift: "22-06", p1: "김우남", p2: "주정현" }
        ],
        tod: [
            { location: "고하도", p1: "박상혁", p2: "이지헌" },
            { location: "-", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-04-21",
        cctv: [
            { shift: "06-14", p1: "박상혁", p2: "이지헌" },
            { shift: "14-22", p1: "정혜수", p2: "한규태" },
            { shift: "22-06", p1: "하태호", p2: "김민기" }
        ],
        tod: [
            { location: "고하도", p1: "최현태", p2: "홍순혁" },
            { location: "-", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-04-22",
        cctv: [
            { shift: "06-14", p1: "최현태", p2: "홍순혁" },
            { shift: "14-22", p1: "김우남", p2: "주정현" },
            { shift: "22-06", p1: "박상혁", p2: "이지헌" }
        ],
        tod: [
            { location: "고하도", p1: "정혜수", p2: "한규태" },
            { location: "외기 평시", p1: "하태호", p2: "김민기" }
        ]
    },
    {
        date: "2026-04-23",
        cctv: [
            { shift: "06-14", p1: "정혜수", p2: "한규태" },
            { shift: "14-22", p1: "하태호", p2: "김민기" },
            { shift: "22-06", p1: "최현태", p2: "홍순혁" }
        ],
        tod: [
            { location: "고하도", p1: "김우남", p2: "주정현" },
            { location: "-", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-04-24",
        cctv: [
            { shift: "06-14", p1: "김우남", p2: "주정현" },
            { shift: "14-22", p1: "박상혁", p2: "이지헌" },
            { shift: "22-06", p1: "정혜수", p2: "한규태" }
        ],
        tod: [
            { location: "고하도", p1: "하태호", p2: "김민기" },
            { location: "-", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-04-25",
        cctv: [
            { shift: "06-14", p1: "하태호", p2: "김민기" },
            { shift: "14-22", p1: "최현태", p2: "홍순혁" },
            { shift: "22-06", p1: "김우남", p2: "주정현" }
        ],
        tod: [
            { location: "고하도", p1: "박상혁", p2: "이지헌" },
            { location: "외기 평시", p1: "정혜수", p2: "한규태" }
        ]
    },
    {
        date: "2026-04-26",
        cctv: [
            { shift: "06-14", p1: "박상혁", p2: "이지헌" },
            { shift: "14-22", p1: "정혜수", p2: "한규태" },
            { shift: "22-06", p1: "하태호", p2: "김민기" }
        ],
        tod: [
            { location: "고하도", p1: "최현태", p2: "홍순혁" },
            { location: "-", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-04-27",
        cctv: [
            { shift: "06-14", p1: "최현태", p2: "홍순혁" },
            { shift: "14-22", p1: "김우남", p2: "주정현" },
            { shift: "22-06", p1: "박상혁", p2: "이지헌" }
        ],
        tod: [
            { location: "고하도", p1: "정혜수", p2: "한규태" },
            { location: "-", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-04-28",
        cctv: [
            { shift: "06-14", p1: "정혜수", p2: "한규태" },
            { shift: "14-22", p1: "하태호", p2: "김민기" },
            { shift: "22-06", p1: "최현태", p2: "홍순혁" }
        ],
        tod: [
            { location: "고하도", p1: "김우남", p2: "주정현" },
            { location: "외기 평시", p1: "박상혁", p2: "이지헌" }
        ]
    },
    {
        date: "2026-04-29",
        cctv: [
            { shift: "06-14", p1: "김우남", p2: "주정현" },
            { shift: "14-22", p1: "박상혁", p2: "이지헌" },
            { shift: "22-06", p1: "정혜수", p2: "한규태" }
        ],
        tod: [
            { location: "고하도", p1: "하태호", p2: "김민기" },
            { location: "-", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-04-30",
        cctv: [
            { shift: "06-14", p1: "하태호", p2: "김민기" },
            { shift: "14-22", p1: "최현태", p2: "홍순혁" },
            { shift: "22-06", p1: "김우남", p2: "주정현" }
        ],
        tod: [
            { location: "고하도", p1: "박상혁", p2: "이지헌" },
            { location: "-", p1: "-", p2: "-" }
        ]
    },
    {
        date: "2026-05-01",
        cctv: [
            { shift: "06-14", p1: "하태호", p2: "김민기" },
            { shift: "14-22", p1: "최현태", p2: "홍순혁" },
            { shift: "22-06", p1: "김우남", p2: "주정현" }
        ],
        tod: [
            { location: "고하도", p1: "박상혁", p2: "이지헌" },
            { location: "-", p1: "-", p2: "-" }
        ]
    }
];
